nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN1_Init(void);
static void MX_CAN2_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void command_receive(can_command_data_t *com);
void robomas_receive(uint8_t robomas_id, uint8_t *data);
void pid_reset(pid_t *pid);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan)
{
  CAN_RxHeaderTypeDef rx_header;
  uint8_t rx_data[8];
  if(HAL_CAN_GetRxMessage(hcan,CAN_RX_FIFO0,&rx_header,rx_data) != HAL_OK)return;
  if (hcan->Instance == COMMAND_CAN) {
    can_command_data_t com = {
      .id = rx_header.StdId,
    };
    memcpy(com.data.raw, rx_data, rx_header.DLC);
    command_receive(&com);
  }else if (hcan->Instance == ROBOMAS_CAN) {
    if (rx_header.IDE != CAN_ID_STD || (rx_header.StdId < 0x201 || rx_header.StdId > 0x204))return;
    uint8_t robomas_id = rx_header.StdId - 0x201; // 201→0, 202→1, 203→2
    robomas_receive(robomas_id, rx_data);
  }
}

void command_receive(can_command_data_t *com){
  switch (com->id) {
  case CAN_ID_LOWER_ARM_COMMAND:
    if(robomas_lower_r.state != ROBOMAS_READY || robomas_lower_deg.state != ROBOMAS_READY)return;
    coordinate_lower.x = com->data.lower_arm.x;
    coordinate_lower.y = com->data.lower_arm.y;
    break;  
  case CAN_ID_UPPER_ARM_COMMAND:
    if(robomas_upper_r.state != ROBOMAS_READY || robomas_upper_deg.state != ROBOMAS_READY)return;
    coordinate_upper.x = com->data.upper_arm.x;
    coordinate_upper.y = com->data.upper_arm.y;
    break;
  case CAN_ID_UPPER_HOMING:
    if(!robomas_upper_deg.feedback.initialized || !robomas_upper_r.feedback.initialized)return;
    if(robomas_upper_r.state == ROBOMAS_IDLE || robomas_upper_deg.state == ROBOMAS_IDLE){
      // 既に受理済みの要求の再送(ACK消失)ならACKを返し直す．新規の要求は無視する．
      if(com->data.homing_sequence == upper_homing_sequence){
        stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
          .id = CAN_ID_UPPER_HOMING_ACK,
          .data.homing_sequence = upper_homing_sequence,
        });
      }
      return;
    }
    if(robomas_upper_r.state == ROBOMAS_ERROR || robomas_upper_deg.state == ROBOMAS_ERROR){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_ERROR_CODE,
        .data.error_code = CAN_ERROR_UPPER_HOMING_REJECTED,
      });
      return;
    }
    //INITAIL -> HOMING or READY -> HOMING
    upper_homing_sequence = com->data.homing_sequence;
    upper_homing_done_ack_pending = false; // 前回分の再送待ちが残っていたら破棄
    upper_homing_timeout_notified = false;
    pid_reset(&robomas_upper_r.rpm_pid);
    pid_reset(&robomas_upper_deg.rpm_pid);
    robomas_upper_r.state = ROBOMAS_HOMING;
    robomas_upper_deg.state = ROBOMAS_HOMING;
    upper_homing_start_time = HAL_GetTick();

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_UPPER_HOMING_ACK,
      .data.homing_sequence = upper_homing_sequence,
    });
    break;
  case CAN_ID_LOWER_HOMING:
    if(!robomas_lower_deg.feedback.initialized || !robomas_lower_r.feedback.initialized)return;
    if(robomas_lower_r.state == ROBOMAS_IDLE || robomas_lower_deg.state == ROBOMAS_IDLE){
      // 既に受理済みの要求の再送(ACK消失)ならACKを返し直す．新規の要求は無視する．
      if(com->data.homing_sequence == lower_homing_sequence){
        stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
          .id = CAN_ID_LOWER_HOMING_ACK,
          .data.homing_sequence = lower_homing_sequence,
        });
      }
      return;
    }
    if(robomas_lower_r.state == ROBOMAS_ERROR || robomas_lower_deg.state == ROBOMAS_ERROR){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_ERROR_CODE,
        .data.error_code = CAN_ERROR_LOWER_HOMING_REJECTED,
      });
      return;
    }
    //INITAIL -> HOMING or READY -> HOMING
    lower_homing_sequence = com->data.homing_sequence;
    lower_homing_done_ack_pending = false; // 前回分の再送待ちが残っていたら破棄
    lower_homing_timeout_notified = false;
    pid_reset(&robomas_lower_r.rpm_pid);
    pid_reset(&robomas_lower_deg.rpm_pid);
    robomas_lower_r.state = ROBOMAS_HOMING;
    robomas_lower_deg.state = ROBOMAS_HOMING;
    lower_homing_start_time = HAL_GetTick();

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_LOWER_HOMING_ACK,
      .data.homing_sequence = lower_homing_sequence,
    });
    break;
  case CAN_ID_UPPER_HOMING_DONE_ACK:
    if(com->data.homing_sequence == upper_homing_sequence){
      upper_homing_done_ack_pending = false;
    }
    break;
  case CAN_ID_LOWER_HOMING_DONE_ACK:
    if(com->data.homing_sequence == lower_homing_sequence){
      lower_homing_done_ack_pending = false;
    }
    break;
  default:
    break;
  }
}

void robomas_receive(uint8_t robomas_id, uint8_t *data){
// Robomasterからのフィードバック
  robomas[robomas_id].feedback.angle_raw =   ((uint16_t)data[0] << 8) | data[1];
  robomas[robomas_id].feedback.rpm =         ((int16_t)data[2] << 8) | data[3];
  robomas[robomas_id].feedback.current =     ((int16_t)data[4] << 8) | data[5];
  robomas[robomas_id].feedback.temperature = data[6]; 

  if(!robomas[robomas_id].feedback.initialized){
    robomas[robomas_id].feedback.total_angle = robomas[robomas_id].feedback.angle_raw;
    robomas[robomas_id].feedback.last_angle = robomas[robomas_id].feedback.angle_raw;
    robomas[robomas_id].feedback.initialized = true;
    robomas[robomas_id].feedback.last_update = HAL_GetTick();
    return;
  }

  int16_t delta = robomas[robomas_id].feedback.angle_raw - robomas[robomas_id].feedback.last_angle;

  if (delta > ROBOMAS_ANGLE_RESOLUTION / 2){
      delta -= ROBOMAS_ANGLE_RESOLUTION;
  }else if (delta < -ROBOMAS_ANGLE_RESOLUTION / 2){
      delta += ROBOMAS_ANGLE_RESOLUTION;
  }

  robomas[robomas_id].feedback.total_angle += delta;
  robomas[robomas_id].feedback.last_angle = robomas[robomas_id].feedback.angle_raw;
  robomas[robomas_id].feedback.last_update = HAL_GetTick();
}

void robomas_send_torque(robomas_t rb[]){
  for(int i = 0; i < ROBOMAS_NUM; i++){
    if(rb[i].tx_torque > ROBOMAS_MAX_TORQUE)rb[i].tx_torque = ROBOMAS_MAX_TORQUE;
    if(rb[i].tx_torque < -ROBOMAS_MAX_TORQUE)rb[i].tx_torque = -ROBOMAS_MAX_TORQUE;
  }
  if(0 < HAL_CAN_GetTxMailboxesFreeLevel(&ROBOMAS_HCAN)){
    CAN_TxHeaderTypeDef TxHeader;
    uint32_t TxMailbox;
    uint8_t TxData[8];
    TxHeader.StdId = 0x200;                 // CAN ID
    TxHeader.RTR = CAN_RTR_DATA;            // フレームタイプはデータフレーム
    TxHeader.IDE = CAN_ID_STD;              // 標準ID(11ﾋﾞｯﾄ)
    TxHeader.DLC = 8;                       // データ長は8バイトに
    TxHeader.TransmitGlobalTime = DISABLE;  // ???
    TxData[0] = rb[0].tx_torque >> 8 & 0x00FF;
    TxData[1] = rb[0].tx_torque & 0x00FF;
    TxData[2] = rb[1].tx_torque >> 8 & 0x00FF;
    TxData[3] = rb[1].tx_torque & 0x00FF;
    TxData[4] = rb[2].tx_torque >> 8 & 0x00FF;
    TxData[5] = rb[2].tx_torque & 0x00FF;
    TxData[6] = rb[3].tx_torque >> 8 & 0x00FF;
    TxData[7] = rb[3].tx_torque & 0x00FF;   
    HAL_CAN_AddTxMessage(&ROBOMAS_HCAN, &TxHeader, TxData, &TxMailbox);
  }
}
/**
* @brief 目標値sp,制御量pvに基づいてpid式で操作量mvを計算し，結果をmvに格納する
* @return 操作量を返す
  double p;   //比例ゲイン
  double i;   //積分ゲイン
  double d;   //微分ゲイン
  double mv;  //manipulated value 操作量
  double sv;  //set value 目標値
  double it;  //integral term 積分項 偏差の総和
  double pe;  //previous error 直前の偏差
  double pv;  //process value 制御量 フィードバック
*/
double calc_pid(pid_t *pid){
  uint32_t now = HAL_GetTick();
  if(now == pid->last_update)return pid->mv;
  double delta_sec = (now - pid->last_update)/1000.0;
  double e =  pid->sv - pid->pv; //erro 偏差
  double dt = (e - pid->pe)/delta_sec; //derivative term 微分項
  pid->it += e * delta_sec;
  pid->mv = pid->p * e + pid->i * pid->it + pid->d * dt;
  pid->pe = e;
  pid->last_update = now;
  return pid->mv;
}

/**
* @brief 積分項，直前の偏差，操作量をリセット．last_updateも更新する．
*/
void pid_reset(pid_t *pid){
    pid->it = 0.0;
    pid->pe = 0.0;
    pid->mv = 0.0;
    pid->last_update = HAL_GetTick();
}

