nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
/*in main roop begin*/
void upper_homing(){
  // HOMING_DONEを送信済みでHOMING_DONE_ACK待ちの場合，一定時間ごとに再送する
  if(upper_homing_done_ack_pending &&
     HAL_GetTick() - upper_homing_done_sent_time > HOMING_DONE_ACK_RETRY_MS){
    if(upper_homing_done_retry_count < HOMING_DONE_ACK_MAX_RETRY){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_UPPER_HOMING_DONE,
        .data.homing_sequence = upper_homing_sequence,
      });
      upper_homing_done_sent_time = HAL_GetTick();
      upper_homing_done_retry_count++;
    }else{
      upper_homing_done_ack_pending = false; //諦める
    }
  }

  if(robomas_upper_r.state == ROBOMAS_READY && robomas_upper_deg.state == ROBOMAS_READY)return;

  if(!upper_homing_timeout_notified &&
     (robomas_upper_deg.state == ROBOMAS_HOMING || robomas_upper_deg.state == ROBOMAS_IDLE ||
      robomas_upper_r.state   == ROBOMAS_HOMING || robomas_upper_r.state   == ROBOMAS_IDLE) &&
     HAL_GetTick() - upper_homing_start_time > HOMING_UPPER_ARM_TIMEOUT_MS){
    // ROBOMAS_ERROR中の軸はrobomas_update()が管理するのでここでは触らない
    if(robomas_upper_deg.state != ROBOMAS_ERROR)robomas_upper_deg.state = ROBOMAS_INITIAL;
    if(robomas_upper_r.state   != ROBOMAS_ERROR)robomas_upper_r.state   = ROBOMAS_INITIAL;

    upper_homing_timeout_notified = true;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_ERROR_CODE,
      .data.error_code = CAN_ERROR_UPPER_HOMING_TIMEOUT,
    });
  }

  if(robomas_upper_deg.state == ROBOMAS_HOMING && UPPER_ARM_DEG_UNDER_LIMIT_ON){
    robomas_upper_deg.state = ROBOMAS_IDLE;
    // 上のアームはハンドの取り付け側が下のアームと逆なため，偏角の下限(UPPER_ARM_DEG_MIN=180度)が
    // リミットスイッチ位置になる。R軸のUPPER_ARM_R_MINオフセットと同様に，
    // set_robomas_deg_from_coordinate()がtheta=0基準で計算するsvと辻褄が合うよう，
    // ここでtheta=UPPER_ARM_DEG_MIN分のオフセットをtotal_angle_homeへ焼き込む。
    robomas_upper_deg.total_angle_home = robomas_upper_deg.feedback.total_angle
      - UPPER_ARM_DEG_ROBOMAS_DIRECTION * (UPPER_ARM_DEG_MIN / 360.0) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * robomas_upper_deg.gear_ratio;
    pid_reset(&robomas_upper_deg.rpm_pid);
  }
    
  if(robomas_upper_r.state == ROBOMAS_HOMING && UPPER_ARM_R_LIMIT_ON){
    robomas_upper_r.state = ROBOMAS_IDLE;
    robomas_upper_r.total_angle_home = robomas_upper_r.feedback.total_angle - UPPER_ARM_R_ROBOMAS_DIRECTION * UPPER_ARM_R_MIN / (R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
    pid_reset(&robomas_upper_r.rpm_pid);
  }

  if(robomas_upper_r.state == ROBOMAS_IDLE && robomas_upper_deg.state == ROBOMAS_IDLE){
    pid_reset(&robomas_upper_r.ang_pid);
    pid_reset(&robomas_upper_deg.ang_pid);
    
    robomas_upper_r.state = ROBOMAS_READY;
    robomas_upper_deg.state = ROBOMAS_READY;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_UPPER_HOMING_DONE,
      .data.homing_sequence = upper_homing_sequence,
    });
    upper_homing_done_ack_pending = true;
    upper_homing_done_sent_time = HAL_GetTick();
    upper_homing_done_retry_count = 0;
    return;
  }
}

void lower_homing(){
  // HOMING_DONEを送信済みでHOMING_DONE_ACK待ちの場合，一定時間ごとに再送する
  if(lower_homing_done_ack_pending &&
     HAL_GetTick() - lower_homing_done_sent_time > HOMING_DONE_ACK_RETRY_MS){
    if(lower_homing_done_retry_count < HOMING_DONE_ACK_MAX_RETRY){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_LOWER_HOMING_DONE,
        .data.homing_sequence = lower_homing_sequence,
      });
      lower_homing_done_sent_time = HAL_GetTick();
      lower_homing_done_retry_count++;
    }else{
      lower_homing_done_ack_pending = false; //諦める
    }
  }

  if(robomas_lower_r.state == ROBOMAS_READY && robomas_lower_deg.state == ROBOMAS_READY)return;
  if(!lower_homing_timeout_notified &&
     (robomas_lower_deg.state == ROBOMAS_HOMING || robomas_lower_deg.state == ROBOMAS_IDLE ||
      robomas_lower_r.state   == ROBOMAS_HOMING || robomas_lower_r.state   == ROBOMAS_IDLE) &&
     HAL_GetTick() - lower_homing_start_time > HOMING_LOWER_ARM_TIMEOUT_MS){
    // ROBOMAS_ERROR中の軸はrobomas_update()が管理するのでここでは触らない
    if(robomas_lower_deg.state != ROBOMAS_ERROR)robomas_lower_deg.state = ROBOMAS_INITIAL;
    if(robomas_lower_r.state   != ROBOMAS_ERROR)robomas_lower_r.state   = ROBOMAS_INITIAL;

    lower_homing_timeout_notified = true;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_ERROR_CODE,
      .data.error_code = CAN_ERROR_LOWER_HOMING_TIMEOUT,
    });
  }

  if(robomas_lower_deg.state == ROBOMAS_HOMING && LOWER_ARM_DEG_UNDER_LIMIT_ON){
    robomas_lower_deg.state = ROBOMAS_IDLE;
    robomas_lower_deg.total_angle_home = robomas_lower_deg.feedback.total_angle;
    pid_reset(&robomas_lower_deg.rpm_pid);
  }
    
  if(robomas_lower_r.state == ROBOMAS_HOMING && LOWER_ARM_R_LIMIT_ON){
    robomas_lower_r.state = ROBOMAS_IDLE;
    robomas_lower_r.total_angle_home = robomas_lower_r.feedback.total_angle - LOWER_ARM_R_ROBOMAS_DIRECTION * LOWER_ARM_R_MIN / (R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION;
    pid_reset(&robomas_lower_r.rpm_pid);
  }

  if(robomas_lower_r.state == ROBOMAS_IDLE && robomas_lower_deg.state == ROBOMAS_IDLE){
    pid_reset(&robomas_lower_r.ang_pid);
    pid_reset(&robomas_lower_deg.ang_pid);
    
    robomas_lower_r.state = ROBOMAS_READY;
    robomas_lower_deg.state = ROBOMAS_READY;

    stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
      .id = CAN_ID_LOWER_HOMING_DONE,
      .data.homing_sequence = lower_homing_sequence,
    });
    lower_homing_done_ack_pending = true;
    lower_homing_done_sent_time = HAL_GetTick();
    lower_homing_done_retry_count = 0;
    return;
  }
}

double get_r(robomas_t *rb)
{
    double motor_angle =
        rb->feedback.total_angle - rb->total_angle_home;

    return LOWER_ARM_R_ROBOMAS_DIRECTION
     * motor_angle
     / ROBOMAS_ANGLE_RESOLUTION
     * (R_ROBOMAS_DIAMETER * M_PI);
}

/**
* @brief ホーミングrpmを目標値svにセットする．
* @return 正常なら引数を返す．異常ならNULL． 
*/
robomas_t *set_robomas_homing_rpm(robomas_t *rb){
  if(rb == &robomas_lower_deg){
    rb->rpm_pid.sv = -LOWER_ARM_DEG_ROBOMAS_DIRECTION * HOMING_LOWER_DEG_RPM * rb->gear_ratio;
  }else if(rb == &robomas_upper_deg){
    rb->rpm_pid.sv = -UPPER_ARM_DEG_ROBOMAS_DIRECTION * HOMING_UPPER_DEG_RPM * rb->gear_ratio;
  }else if(rb == &robomas_lower_r){
    rb->rpm_pid.sv = -LOWER_ARM_R_ROBOMAS_DIRECTION * HOMING_LOWER_R_RPM * rb->gear_ratio;
  }else if(rb == &robomas_upper_r){
    rb->rpm_pid.sv = -UPPER_ARM_R_ROBOMAS_DIRECTION * HOMING_UPPER_R_RPM * rb->gear_ratio;
  }else{return NULL;}
  return rb;
}
/**
* @brief 座標に対応するロボマスの角度(一周あたり8192)を座標から計算し，角度目標値svにセットする．
* @return 正常なら引数を返す．異常ならNULL． 
**/
robomas_t *set_robomas_deg_from_coordinate(robomas_t *rb){
  if(rb == &robomas_lower_deg){
    rb->ang_pid.sv = LOWER_ARM_DEG_ROBOMAS_DIRECTION * to_polar(coordinate_lower).theta / (2 * M_PI) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else if(rb == &robomas_lower_r){
    rb->ang_pid.sv = LOWER_ARM_R_ROBOMAS_DIRECTION * to_polar(coordinate_lower).r /(R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else if(rb == &robomas_upper_deg){
    rb->ang_pid.sv = UPPER_ARM_DEG_ROBOMAS_DIRECTION * to_polar(coordinate_upper).theta / (2 * M_PI) * POLAR_RATIO * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else if(rb == &robomas_upper_r){
    rb->ang_pid.sv = UPPER_ARM_R_ROBOMAS_DIRECTION * to_polar(coordinate_upper).r /(R_ROBOMAS_DIAMETER * M_PI) * ROBOMAS_ANGLE_RESOLUTION * rb->gear_ratio;
  }else{return NULL;}
  return rb;
}

/**
* @brief フィードバック途絶によりROBOMAS_ERRORへ遷移した軸を特定するエラーコードを返す．
*/
can_error_t get_lost_control_error_code(robomas_t *rb){
  if(rb == &robomas_lower_r)        return CAN_ERROR_LOWER_R_LOST_CONTROL;
  else if(rb == &robomas_lower_deg) return CAN_ERROR_LOWER_DEG_LOST_CONTROL;
  else if(rb == &robomas_upper_r)   return CAN_ERROR_UPPER_R_LOST_CONTROL;
  else                              return CAN_ERROR_UPPER_DEG_LOST_CONTROL;
}

