nyankowan/CatchRobo_2026/STM32/robomas_controller/Core/Src/main.c
void robomas_update(robomas_t *rb){
  robomas_state_t prev_state = rb->state;

  if(HAL_GetTick() - rb->feedback.last_update > ROBOMAS_FEEDBACK_TIMEOUT_MS){
    rb->state = ROBOMAS_ERROR;
    if(prev_state != ROBOMAS_ERROR){
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){
        .id = CAN_ID_ERROR_CODE,
        .data.error_code = get_lost_control_error_code(rb),
      });
    }
  }else if(rb->state == ROBOMAS_ERROR){
    rb->state = ROBOMAS_INITIAL;
  }

  switch(rb->state){
    case ROBOMAS_HOMING:
      set_robomas_homing_rpm(rb);
      break;

    case ROBOMAS_IDLE:
      rb->rpm_pid.sv = 0;
      break;

    case ROBOMAS_READY:
      set_robomas_deg_from_coordinate(rb);
      rb->ang_pid.pv = rb->feedback.total_angle- rb->total_angle_home;
      rb->rpm_pid.sv = calc_pid(&rb->ang_pid);
      break;

    case ROBOMAS_ERROR:
    case ROBOMAS_INITIAL:
    default:
      rb->tx_torque = 0;
      return;

  }
  rb->rpm_pid.pv = rb->feedback.rpm;
  rb->tx_torque = calc_pid(&rb->rpm_pid);
}

/**
* @brief Status_LEDの点滅を管理する．
*        lower/upperそれぞれがREADY(r軸・deg軸とも)でなければ「未ホーミング」とみなす．
*        lowerのみ未ホーミング:1回点滅 upperのみ:2回点滅 両方:3回点滅 両方READY:常時点灯
*        周期的(mainループ毎)に呼び出すこと．
*/
void status_led_update(){
  bool lower_ready = (robomas_lower_r.state == ROBOMAS_READY && robomas_lower_deg.state == ROBOMAS_READY);
  bool upper_ready = (robomas_upper_r.state == ROBOMAS_READY && robomas_upper_deg.state == ROBOMAS_READY);

  if(lower_ready && upper_ready){
    HAL_GPIO_WritePin(Status_LED_GPIO_Port, Status_LED_Pin, GPIO_PIN_SET);
    status_led_blink_index = 0;
    status_led_on = false;
    status_led_phase_start = HAL_GetTick();
    return;
  }

  uint8_t blink_count = (lower_ready ? 0 : 1) + (upper_ready ? 0 : 2);

  uint32_t now = HAL_GetTick();
  uint32_t elapsed = now - status_led_phase_start;

  if(status_led_on){
    if(elapsed >= STATUS_LED_BLINK_ON_MS){
      HAL_GPIO_WritePin(Status_LED_GPIO_Port, Status_LED_Pin, GPIO_PIN_RESET);
      status_led_on = false;
      status_led_phase_start = now;
      status_led_blink_index++;
    }
  }else{
    bool cycle_done = (status_led_blink_index >= blink_count);
    uint32_t off_duration = cycle_done ? STATUS_LED_BLINK_PAUSE_MS : STATUS_LED_BLINK_OFF_MS;

    if(elapsed >= off_duration){
      if(cycle_done)status_led_blink_index = 0; //一巡したので最初から

      HAL_GPIO_WritePin(Status_LED_GPIO_Port, Status_LED_Pin, GPIO_PIN_SET);
      status_led_on = true;
      status_led_phase_start = now;
    }
  }
}

/*in main roop end*/



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  uint32_t last_heartbeat = HAL_GetTick();
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN1_Init();
  MX_CAN2_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

  HAL_CAN_Start(&hcan1);
  HAL_CAN_Start(&hcan2);

  HAL_CAN_ActivateNotification(
      &hcan1,
      CAN_IT_RX_FIFO0_MSG_PENDING
  );

  HAL_CAN_ActivateNotification(
      &hcan2,
      CAN_IT_RX_FIFO0_MSG_PENDING
  );
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  // ここで全ROBOMAS_NUM分のフィードバックを待つと，一部のロボマスターしか
  // 接続していない状態(例: 動作確認で下アームの2台のみ接続)ではメインループに
  // 一切到達できず，接続済みのロボマスターについても
  // 制御・Heartbeat送信・Status_LED表示等が何も行われない(＝外から見て
  // 「ロボマスがつながっているのにフィードバックを受け取れない」ように見える)．
  // 未接続の軸はrobomas_update()のROBOMAS_FEEDBACK_TIMEOUT_MSタイムアウトにより
  // 自動的にROBOMAS_ERRORへ遷移しCAN_ID_ERROR_CODEで通知されるので，
  // ここで全台の初期化を待つ必要はない．

  for(int i = 0; i < ROBOMAS_NUM; i++){
    pid_reset(&robomas[i].rpm_pid);
    pid_reset(&robomas[i].ang_pid);
  }

  while (1)
  {
    upper_homing();
    lower_homing();

    for(int i = 0; i < ROBOMAS_NUM; i++){
      robomas_update(&robomas[i]);
    }

    robomas_send_torque(robomas);
    status_led_update();
    
    if(HAL_GetTick() - last_heartbeat > HEARTBEAT_MS){
      last_heartbeat = HAL_GetTick();
      stm_can_send(&COMMAND_HCAN, &(can_command_data_t){.id = CAN_ID_ROBOMAS_CONTROLLER_HEARTBEAT});
    }
    HAL_Delay(LOOP_MS);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 60;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief CAN1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_CAN1_Init(void)
{

  /* USER CODE BEGIN CAN1_Init 0 */

